<a href="https://colab.research.google.com/github/xuandy05/Python-A.I./blob/master/Pandas_Practice_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

### Creating a Series
> Create a Series with the values: [1,2,3,4,5,12,11,123] <br>
> Create another Series with the values: ["a","b","c","d","e","f","g","h"]

In [0]:
s1 = pd.Series([1,2,3,4,5,12,11,123])
s1

0      1
1      2
2      3
3      4
4      5
5     12
6     11
7    123
dtype: int64

In [0]:
s2 = pd.Series(['a','b','c','d','e','f','g','h'])
s2

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
dtype: object

### Creating a Data Frame
> Create a Dataframe with the previous 2 series as the columns. The column names should be "letter" and "numbers" respectively

In [0]:
df = pd.DataFrame({"letters":s2, "numbers":s1})
df

  letters  numbers
0       a        1
1       b        2
2       c        3
3       d        4
4       e        5
5       f       12
6       g       11
7       h      123

In [0]:
df.letters
df['letters']

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
Name: letters, dtype: object

> Get the number of entries in the DataFrame

In [0]:
df.size
df["letters"].size

8

### Indexing into a DF

In [0]:
df["numbers"][0]

1

### Adding a Column
> Add another column to your dataframe. The column name should be "more letters" and the values can be whatever letters you want.

In [0]:
df = pd.DataFrame({"letters":s2, "numbers":s1})
df.insert(0, "more letters", 'a', True)
df

  more letters letters  numbers
0            a       a        1
1            a       b        2
2            a       c        3
3            a       d        4
4            a       e        5
5            a       f       12
6            a       g       11
7            a       h      123

In [0]:
df.insert(0, "more numbers", ['6','7','8','9','10','11','12','13'])
df

  more numbers more letters letters  numbers
0            6            a       a        1
1            7            a       b        2
2            8            a       c        3
3            9            a       d        4
4           10            a       e        5
5           11            a       f       12
6           12            a       g       11
7           13            a       h      123

### Remove a Column
> Delete the letters column

In [0]:
df = df.drop('letters', 1)
df

  more numbers more letters  numbers
0            6            a        1
1            7            a        2
2            8            a        3
3            9            a        4
4           10            a        5
5           11            a       12
6           12            a       11
7           13            a      123

### Boolean Indexing<br>
> Use booleaning Index to get all the rows with numbers greater than 10

In [0]:
df = df[df['numbers'] > 3]
df[df['numbers'] < 100]

  more numbers more letters  numbers
3            9            a        4
4           10            a        5
5           11            a       12
6           12            a       11